---
kind: other
id: Methods.T:Autodesk.Revit.DB.FabricationServiceSettings
source: html/6b503ac1-cca8-d7c7-d785-efe53d97d827.htm
---
# FabricationServiceSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.